import { IDictionary } from "./mock.types";

export const historicalDates: IDictionary<object> = {
	"1990": [
		{
			eventId: "16eab006-df8f-490a-986d-f59acdf32bd8",
			year: 1990,
			description:
				"Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
			category: "Космос",
		},
		{
			eventId: "26eab006-df8f-490a-986d-f59acdf32bd8",
			year: 1991,
			description:
				"Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
			category: "Космос",
		},
		{
			eventId: "36eab006-df8f-490a-986d-f59acdf32bd8",
			year: 1992,
			description:
				"Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
			category: "Космос",
		},
		{
			eventId: "46eab006-df8f-490a-986d-f59acdf32bd8",
			year: 1993,
			description:
				"Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
			category: "Космос",
		},
		{
			eventId: "56eab006-df8f-490a-986d-f59acdf32bd8",
			year: 1994,
			description:
				"Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
			category: "Космос",
		},
		{
			eventId: "66eab006-df8f-490a-986d-f59acdf32bd8",
			year: 1995,
			description:
				"Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
			category: "Космос",
		},
	],
	"1995": [
		{
			eventId: "61eab006-df8f-490a-986d-f59acdf32bd8",
			year: 1995,
			description:
				"Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
			category: "Космос",
		},
	],
	"2000": [
		{
			eventId: "661ab006-df8f-490a-986d-f59acdf32bd8",
			year: 2000,
			description:
				"Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
			category: "Космос",
		},
	],
	"2010": [
		{
			eventId: "66ea1006-df8f-490a-986d-f59acdf32bd8",
			year: 2010,
			description:
				"Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
			category: "Космос",
		},
		{
			eventId: "66ea2006-df8f-490a-986d-f59acdf32bd8",
			year: 2011,
			description:
				"Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
			category: "Космос",
		},
		{
			eventId: "66ea3006-df8f-490a-986d-f59acdf32bd8",
			year: 2012,
			description:
				"Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
			category: "Космос",
		},
		{
			eventId: "66ea4006-df8f-490a-986d-f59acdf32bd8",
			year: 2013,
			description:
				"Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
			category: "Космос",
		},
	],
	"2015": [
		{
			eventId: "66eab006-df8f-490a-986d-f59acdf32bd8",
			year: 2015,
			description:
				"Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
			category: "Космос",
		},
		{
			eventId: "66eab006-df8f-490a-986d-f59acdf32bd3",
			year: 2016,
			description:
				"Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
			category: "Космос",
		},
		{
			eventId: "66eab006-df8f-490a-986d-f59acdf32bd2",
			year: 2017,
			description:
				"Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
			category: "Космос",
		},
		{
			eventId: "66eab006-df8f-490a-986d-f59acdf32118",
			year: 2018,
			description:
				"Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
			category: "Космос",
		},
		{
			eventId: "66eab006-df8f-490a-986a-f59acdf32b22",
			year: 2019,
			description:
				"Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
			category: "Космос",
		},
		{
			eventId: "66eab006-df8f-490a-986d-f59acd232138",
			year: 2020,
			description:
				"Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
			category: "Космос",
		},
	],
	"2020": [
		{
			eventId: "66eab006-df8f-490a-986d-f59acdf32bd8",
			year: 2020,
			description:
				"Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
			category: "Космос",
		},
		{
			eventId: "66eab006-df8f-490a-986d-f51acdf32bd8",
			year: 2021,
			description:
				"Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
			category: "Космос",
		},
	],
};
